# BendDiameterDimensionsEnabled Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarBendingDetailType..::..BendDiameterDimensionsEnabled Property
RebarBendingDetailType Class See Also
---
Identifies if any radial or diameter dimensions will be shown or not.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public bool BendDiameterDimensionsEnabled { get; set; }
```

Visual Basic
---
```text
Public Property BendDiameterDimensionsEnabled As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool BendDiameterDimensionsEnabled {
	bool get ();
	void set (bool value);
}
```

# See Also
RebarBendingDetailType Class
Autodesk.Revit.DB.Structure Namespace